proj-xcode/PA2TestWrapper/PowerAuthServerSOAP/SoapRequests.bundle/RemoveActivation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pow="http://getlime.io/security/powerauth">
   <soapenv:Header/>
   <soapenv:Body>
      <pow:RemoveActivationRequest>
         <pow:activationId>$1</pow:activationId>
      </pow:RemoveActivationRequest>
   </soapenv:Body>
</soapenv:Envelope>
