proj-xcode/TestClasses/PowerAuthServerSOAP/SoapRequests.bundle/UnblockActivation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pow="http://getlime.io/security/powerauth">
   <soapenv:Header/>
   <soapenv:Body>
      <pow:UnblockActivationRequest>
         <pow:activationId>$1</pow:activationId>
      </pow:UnblockActivationRequest>
   </soapenv:Body>
</soapenv:Envelope>
