proj-xcode/TestClasses/PowerAuthServerSOAP/SoapRequests.bundle/InitActivation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pow="http://getlime.io/security/powerauth">
   <soapenv:Header/>
   <soapenv:Body>
      <pow:InitActivationRequest>
         <pow:userId>$1</pow:userId>
         <pow:applicationId>$2</pow:applicationId>
      </pow:InitActivationRequest>
   </soapenv:Body>
</soapenv:Envelope>
